Operations

In [57]:
import pandas as pd

df = pd.read_csv("data/sales_data.csv")
df.head(5) #Top 5  rec

df.tail(5) #Last 5 rec

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

Accessing data from dataframe

In [58]:
print(f"{df['Product Name']}") #Specific column along with index
print(type(df['Product Name']))

print(f"ROW - {df.loc[0]}") # Row Index

print(f"COLUMN - {df.iloc[0]}") #Column Index

0                                        iPhone 14 Pro
1                                     Dyson V11 Vacuum
2                                     Levi's 501 Jeans
3                                    The Da Vinci Code
4                              Neutrogena Skincare Set
                            ...
235    Nespresso Vertuo Next Coffee and Espresso Maker
236                          Nike Air Force 1 Sneakers
237             The Handmaid's Tale by Margaret Atwood
238               Sunday Riley Luna Sleeping Night Oil
239                         Yeti Rambler 20 oz Tumbler
Name: Product Name, Length: 240, dtype: object
<class 'pandas.core.series.Series'>
ROW - Transaction ID              10001
Date                   2024-01-01
Product Category      Electronics
Product Name        iPhone 14 Pro
Units Sold                      2
Unit Price                 999.99
Total Revenue             1999.98
Region              North America
Payment Method        Credit Card
Name: 0, dtype: object
COLUMN - Transaction ID              10001
Date                   2024-01-01
Product Category      Electronics
Product Name        iPhone 14 Pro
Units Sold                      2
Unit Price                 999.99
Total Revenue             1999.98
Region              North America
Payment Method        Credit Card
Name: 0, dtype: object

Understanding of loc and Iloc

Simple rule: Use loc when you know the name, use iloc when you know the position.

In [59]:
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['NYC', 'LA', 'Chicago']
}, index=['a', 'b', 'c'])

# Select by label
df.loc['a']  # Row with index 'a'
df.loc['a':'b']  # Rows 'a' to 'b' (inclusive)
df.loc['a', 'Name']  # Specific cell
df.loc[:, 'Age']  # All rows, 'Age' column

# Select by position
df.iloc[0]  # First row
df.iloc[0:2]  # First two rows (0 and 1, excludes 2)
df.iloc[0, 1]  # First row, second column
df.iloc[:, 1]  # All rows, second column

a    25
b    30
c    35
Name: Age, dtype: int64

Accessing specified element

In [60]:
df.at['a','Name']
df.iat[2,2]

'Chicago'

| Method | Uses | Example |
|--------|------|---------|
| `at` | Labels (single value) | `df.at['c', 'Name']` |
| `iat` | Integer positions (single value) | `df.iat[2, 0]` |
| `loc` | Labels (can select multiple) | `df.loc['c', 'Name']` |
| `iloc` | Integer positions (can select multiple) | `df.iloc[2, 0]` |

Data Manipulation with dataframes

In [61]:
df['Salary']=[2000,3000,4000] #Add Column
print(f"{df}")

##Remove column
df.drop('Salary',axis=1,inplace=True)  #if inplace = T then it will delete permanently else will not !
print(f"{df}")

##Add age to column
df['Age']=df['Age']+2
print(f" After age addition {df}")

      Name  Age     City  Salary
a    Alice   25      NYC    2000
b      Bob   30       LA    3000
c  Charlie   35  Chicago    4000
      Name  Age     City
a    Alice   25      NYC
b      Bob   30       LA
c  Charlie   35  Chicago
 After age addition       Name  Age     City
a    Alice   27      NYC
b      Bob   32       LA
c  Charlie   37  Chicago

Display data types of each column

In [62]:
df=pd.read_csv('data/sales_data.csv')
print(f"Data Types - {df.dtypes}")

print(f"Statistical Summary - \n{df.describe()}")

Data Types - Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object
Statistical Summary -
       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000